Revit 2026 API

# RebarConstraintGetTargetElement(Int32) Method

---

Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element GetTargetElement(
	int targetIndex
)
```
```vb
Public Function GetTargetElement (
	targetIndex As Integer
) As Element
```
```cpp
public:
Element^ GetTargetElement(
	int targetIndex
)
```
```fsharp
member GetTargetElement :
        targetIndex : int -> Element
```

#### Parameters

targetIndex Int32
     The index of the target. Should be between 0 and NumberOfTargets().

#### Return Value

Element Returns the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.

| Exception | Condition |
| --- | --- |
| ArgumentException | targetIndex is out of range. |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint should not be of RebarConstraintType 'ToSurface'. |

#### Reference

RebarConstraint Class

GetTargetElement Overload

Autodesk.Revit.DB.Structure Namespace